settings.org
#+PROPERTY: header-args :tangle yes
* Use-package configuration
:PROPERTIES:
:ID:       b8b9f305-49e7-4844-bdac-fc3e870ca7f8
:END:
#+begin_src elisp
  (require 'use-package)
  (setq use-package-always-ensure t)
#+end_src

* Global utilities and programs
** Helm
:PROPERTIES:
:ID:       c5b772ea-117a-4e9f-883d-81fdd6c21756
:END:
#+begin_src elisp
  (use-package helm
    :demand t
    :bind ("M-x" . helm-M-x)
    ("C-x C-f" . helm-find-files)
    ;; ("<tab>" . helm-execute-persistent-action)
    :config
    (setq 
     helm-completion-style 'emacs)
    :init
    (helm-mode 1))
#+end_src

#+RESULTS:
: helm-find-files
** Visual-line-mode
:PROPERTIES:
:ID:       00e38652-7f52-4efe-ad7b-7436f3172e20
:END:
#+begin_src elisp
  (use-package visual-line-mode
    :ensure nil
    :init
    (global-visual-line-mode t)
    :hook ((org-mode . visual-line-mode)
           (prog-mode . visual-line-mode)))
#+end_src

** Evil-mode
:PROPERTIES:
:ID:       d7417cdf-b545-45f1-98b6-251c90fb224d
:END:
#+begin_src elisp
  (use-package evil
    :demand t
    :init
    (setq 
     evil-cross-lines t
     evil-mode-line-format 'before
     evil-respect-visual-line-mode t
     evil-undo-system 'undo-tree
     evil-want-Y-yank-to-eol t)
    (evil-mode t))
#+end_src

#+RESULTS:

** Evil-org-mode
:PROPERTIES:
:ID:       329255d5-c564-46c8-b7f2-f714c0615cb1
:END:
#+begin_src elisp
  (use-package evil-org
    :ensure t
    :after org
    :hook (org-mode . evil-org-mode)
    :config
    (require 'evil-org-agenda)
    (evil-org-agenda-set-keys)
    (evil-define-key 'motion org-agenda-mode-map
      "e" 'org-agenda-set-effort)
    (evil-define-key nil evil-normal-state-map
      "j" 'evil-next-visual-line
      "k" 'evil-previous-visual-line))
#+end_src

#+RESULTS:
| org-superstar-mode | org-variable-pitch-minor-mode | org-indent-mode | #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | flyspell-mode | org-autolist-mode | org-ref-org-menu | olivetti-mode | evil-org-mode | visual-line-mode | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes |

** Undo tree
:PROPERTIES:
:ID:       b0b02143-47e7-49f6-9813-5c19a8f5e285
:END:
#+begin_src elisp
  (use-package undo-tree
    :demand t
    :config
    (setq undo-tree-auto-save-history t)
    (global-undo-tree-mode t))
#+end_src
shit test blah blah blah
** Electric-Indent-Mode
#+begin_src elisp
  (setq electric-indent-mode t)
#+end_src

* Themes, startup, and ricing
** Page-break-lines stuff
:PROPERTIES:
:ID:       f8a98f04-4b9a-464a-9a0f-c439669f08a0
:END:
#+begin_src elisp 
  (use-package page-break-lines
    :ensure t)
#+end_src

#+RESULTS:

** Powerline                                                      :disabled:
:PROPERTIES:
:ID:       b7e0f6b1-a419-4650-9c82-a95c2053e04d
:END:
#+begin_src elisp :tangle no
  (setq-default mode-line-buffer-identification (list -80 (propertized-buffer-identification "%12b")))
  (setq mode-line-buffer-identification (list -80 (propertized-buffer-identification "%12b")))
  (use-package powerline-evil
    :ensure t
    :demand t
    :config
    (setq powerline-height 26)
    (setq powerline-display-hud t))
  (powerline-evil-center-color-theme)
#+end_src

#+RESULTS:
| %e | (:eval (let* ((active (powerline-selected-window-active)) (mode-line (if active 'mode-line 'mode-line-inactive)) (face1 (if active 'powerline-active1 'powerline-inactive1)) (face2 (if active 'powerline-active2 'powerline-inactive2)) (separator-left (intern (format powerline-%s-%s (powerline-current-separator) (car powerline-default-separator-dir)))) (separator-right (intern (format powerline-%s-%s (powerline-current-separator) (cdr powerline-default-separator-dir)))) (lhs (list (powerline-raw %* nil 'l) (powerline-buffer-size nil 'l) (powerline-buffer-id nil 'l) (powerline-raw  ) (funcall separator-left mode-line face1) (powerline-narrow face1 'l) (powerline-vc face1))) (rhs (list (powerline-raw global-mode-string face1 'r) (powerline-raw %4l face1 'r) (powerline-raw : face1) (powerline-raw %3c face1 'r) (funcall separator-right face1 mode-line) (powerline-raw  ) (powerline-raw %6p nil 'r) (powerline-hud face2 face1))) (center (append (list (powerline-raw   face1) (funcall separator-left face1 face2) (when (boundp 'erc-modified-channels-object) (powerline-raw erc-modified-channels-object face2 'l)) (powerline-major-mode face2 'l) (powerline-process face2) (powerline-raw   face2)) (let ((evil-face (powerline-evil-face))) (if (split-string (format-mode-line minor-mode-alist)) (append (if evil-mode (list (funcall separator-right face2 evil-face) (powerline-raw (powerline-evil-tag) evil-face 'l) (powerline-raw   evil-face) (funcall separator-left evil-face face2))) (list (powerline-minor-modes face2 'l) (powerline-raw   face2) (funcall separator-right face2 face1))) (list (powerline-raw (powerline-evil-tag) evil-face) (funcall separator-right evil-face face1))))))) (concat (powerline-render lhs) (powerline-fill-center face1 (/ (powerline-width center) 2.0)) (powerline-render center) (powerline-fill face1 (powerline-width rhs)) (powerline-render rhs)))) |

** Doom-modeline
#+begin_src elisp
  (use-package doom-modeline
    :ensure t
    :demand t
    :config
    (setq
     doom-modeline-buffer-modification-icon nil
     doom-modeline-hud nil
     doom-modeline-mode t)
    (doom-modeline-mode t))
#+end_src

#+RESULTS:
: t

** Load theme
:PROPERTIES:
:ID:       b56326ad-0713-4091-b60e-94df3810177d
:END:
#+begin_src elisp
  (use-package doom-themes :ensure t :demand t :config (doom-themes-org-config))
  (load-theme 'doom-zenburn t)
#+end_src

#+RESULTS:
: t

** Dashboard
:PROPERTIES:
:ID:       e51457fa-700b-4765-aa36-2506db3af7f1
:END:
#+begin_src elisp
  (use-package dashboard
    :ensure t
    :config
    (setq dashboard-banner-logo-title "Welcome back, Jaden"
          dashboard-items '((recents . 10) (bookmarks . 5))
          dashboard-startup-banner 'logo
          dashboard-center-content t
          dashboard-set-init-info t
          dashboard-set-file-icons t
          dashboard-set-heading-icons t
          dashboard-set-navigator t
          )
    (dashboard-setup-startup-hook))
  (setq initial-buffer-choice (lambda () (get-buffer "*dashboard*")))
#+end_src

** Ligatures (causes crash for some reason)                       :disabled:
:PROPERTIES:
:ID:       adaa80bb-05c5-4848-93df-eb4c0506f1c2
:END:
#+begin_src elisp :tangle no
  (add-to-list 'load-path "~/.emacs.d/lisp/")

  (require 'ligature)
  ;; Enable the www ligature in every possible major mode
  (ligature-set-ligatures 't '("www"))

  ;; Enable ligatures in programming modes                                                           
  (ligature-set-ligatures 'prog-mode '("www" "**" "***" "**/" "*>" "*/" "\\\\" "\\\\\\" "{-" "::"
                                       ":::" ":=" "!!" "!=" "!==" "-}" "----" "-->" "->" "->>"
                                       "-<" "-<<" "-~" "#{" "#[" "##" "###" "####" "#(" "#?" "#_"
                                       "#_(" ".-" ".=" ".." "..<" "..." "?=" "??" ";;" "/*" "/**"
                                       "/=" "/==" "/>" "//" "///" "&&" "||" "||=" "|=" "|>" "^=" "$>"
                                       "++" "+++" "+>" "=:=" "==" "===" "==>" "=>" "=>>" "<="
                                       "<*>" "<|" "<|>" "<$" "<$>" "<!--" "<-" "<--" "<->" "<+"
                                       "<+>" "<=" "<==" ">=" ">==" "<=>" "<=<" "<>" "<<" "<<-" "<<=" "<<<"
                                       "<~" "<~~" "</" "</>" "~@" "~-" "~>" "~~" "~~>" "%%"))

  (global-ligature-mode 't)
#+end_src

** Highlight indent guides
:PROPERTIES:
:ID:       f334eb32-bc02-4879-8f67-ff337c28ee09
:END:
#+begin_src elisp
  (use-package highlight-indent-guides
    :hook
    (prog-mode . highlight-indent-guides-mode))
#+end_src

** Tildes on empty lines
:PROPERTIES:
:ID:       695da9cc-f747-4d25-8757-e37196d0bb7e
:END:
#+begin_src elisp
  (setq-default indicate-empty-lines t)
  ;(define-fringe-bitmap 'tilde [0 0 0 113 219 142 0 0] nil nil 'center)
  ;(setcdr (assq 'empty-line fringe-indicator-alist) 'tilde)
  ;(set-fringe-bitmap-face 'tilde 'font-lock-function-name-face)

#+end_src

#+RESULTS:
: t

** Highlight numbers
#+begin_src elisp
  (use-package highlight-numbers
    :hook (prog-mode . highlight-numbers-mode))
#+end_src

#+RESULTS:
| highlight-numbers-mode | hl-line-mode | linum-mode | company-mode | highlight-indent-guides-mode | visual-line-mode |

* Prog-mode settings
