settings.el
(require 'use-package)
(setq use-package-always-ensure t)

(use-package helm
  :demand t
  :bind ("M-x" . helm-M-x)
  ("C-x C-f" . helm-find-files)
  ;; ("<tab>" . helm-execute-persistent-action)
  :config
  (setq 
   helm-completion-style 'emacs)
  :init
  (helm-mode 1))

(use-package visual-line-mode
  :ensure nil
  :init
  (global-visual-line-mode t)
  :hook ((org-mode . visual-line-mode)
         (prog-mode . visual-line-mode)))

(use-package evil
  :demand t
  :init
  (setq 
   evil-cross-lines t
   evil-mode-line-format 'before
   evil-respect-visual-line-mode t
   evil-undo-system 'undo-tree
   evil-want-Y-yank-to-eol t)
  (evil-mode t))

(use-package evil-org
  :ensure t
  :after org
  :hook (org-mode . evil-org-mode)
  :config
  (require 'evil-org-agenda)
  (evil-org-agenda-set-keys)
  (evil-define-key nil evil-normal-state-map
    "j" 'evil-next-visual-line
    "k" 'evil-previous-visual-line))

(use-package undo-tree
  :demand t
  :config
  (setq undo-tree-auto-save-history t)
  (global-undo-tree-mode t))

(setq electric-indent-mode t)

(use-package page-break-lines
  :ensure t)

(use-package doom-modeline
  :ensure t
  :demand t
  :config
  (setq
   doom-modeline-buffer-modification-icon nil
   doom-modeline-hud nil
   doom-modeline-mode t)
  (doom-modeline-mode t))

(use-package doom-themes :ensure t :demand t :config (doom-themes-org-config))
(load-theme 'doom-one t)

(use-package dashboard
  :ensure t
  :config
  (setq dashboard-banner-logo-title "Welcome back, Jaden"
        dashboard-items '((recents . 10) (bookmarks . 5))
        dashboard-startup-banner 'logo
        dashboard-center-content t
        dashboard-set-init-info t
        dashboard-set-file-icons t
        dashboard-set-heading-icons t
        dashboard-set-navigator t
        )
  (dashboard-setup-startup-hook))
(setq initial-buffer-choice (lambda () (get-buffer "*dashboard*")))

(use-package highlight-indent-guides
  :hook
  (prog-mode . highlight-indent-guides-mode))

(setq-default indicate-empty-lines t)
(define-fringe-bitmap 'tilde [0 0 0 113 219 142 0 0] nil nil 'center)
(setcdr (assq 'empty-line fringe-indicator-alist) 'tilde)
(set-fringe-bitmap-face 'tilde 'font-lock-function-name-face)

(use-package highlight-numbers
  :hook (prog-mode . highlight-numbers-mode))
