settings.org
** LSP
:PROPERTIES:
:ID:       83b996c0-05d9-4522-803a-ac9d39aafd97
:END:
#+begin_src elisp
  (use-package lsp-mode
    :ensure t
    :init
    (setq lsp-keymap-prefix "C-c l")
    :commands lsp lsp-deferred
    :hook ((lsp-after-open . lsp-enable-imenu)
           (lsp-after-open . lsp-toggle-symbol-highlight)
           (lsp-mode . lsp-enable-which-key-integration)
           (lsp-after-open . (lambda ()
                               (setq-local company-minimum-prefix-length 1
                                           company-idle-delay 0.0) ;; default is 0.2
                               )))
    :bind (:map lsp-mode-map
                ("C-c l t" . lsp-describe-thing-at-point)
                ("C-c l d" . lsp-ui-doc-show))
    :config
    (setq lsp-prefer-flymake nil)
    (setq lsp-auto-guess-root t ; Detect project root
          lsp-keep-workspace-alive nil ; Auto-kill LSP server
          lsp-prefer-capf t
          lsp-enable-indentation t
          lsp-enable-symbol-highlighting nil
          lsp-enable-on-type-formatting nil)
    :hook ((c-mode . lsp)
           (python-mode . lsp)))

  ;; lsp-ui: This contains all the higher level UI modules of lsp-mode, like flycheck support and code lenses.
  ;; https://github.com/emacs-lsp/lsp-ui
  (use-package lsp-ui
    :ensure t
    :config
    (define-key lsp-ui-mode-map [remap xref-find-definitions] #'lsp-ui-peek-find-definitions)
    (define-key lsp-ui-mode-map [remap xref-find-references] #'lsp-ui-peek-find-references)
    (setq lsp-ui-sideline-enable nil
          lsp-ui-sideline-update-mode 'line
          lsp-ui-sideline-show-code-actions t
          lsp-ui-sideline-show-hover t
          lsp-ui-doc-enable t
          lsp-ui-doc-delay 1.0
          lsp-ui-doc-position 'bottom
          lsp-ui-doc-alignment 'frame
          lsp-ui-doc-include-signature t
          lsp-ui-doc-use-childframe t
          lsp-ui-doc-include-signature t
          lsp-eldoc-enable-hover nil ; Disable eldoc displays in minibuffer
          lsp-ui-doc-position 'at-point
          lsp-ui-imenu-enable t
          lsp-ui-sideline-ignore-duplicate t)
    :hook ((python-mode . lsp-ui-mode)
           (c-mode . lsp-ui-mode)))

  ;; debugger adapter protocol support for emacs
  ;; https://github.com/emacs-lsp/dap-mode/
  (use-package dap-mode
    :ensure t
    :defer 4
    :config
    ;; call dap-hydra when going to the next breakpoint
    (add-hook 'dap-stopped-hook
              (lambda (arg) (call-interactively #'dap-hydra)))
    (add-hook 'dap-mode-hook #'dap-ui-mode) ; use a hook so users can remove it
    (dap-mode 1))
#+end_src

#+RESULTS:
: t

#+begin_src elisp :tangle no
  (use-package lsp-mode
    :init
    (setq lsp-keymap-prefix "C-c l")
    :config
    (setq lsp-auto-guess-root t
          lsp-keep-workspace-alive nil
          lsp-prefer-capf t
          lsp-enable-indentation nil)
    :hook ((python-mode . lsp)
           (c-mode . lsp))
    :commands lsp)

  (use-package lsp-ui 
    :config
    (define-key lsp-ui-mode-map [remap xref-find-definitions] #'lsp-ui-peek-find-definitions)
    (define-key lsp-ui-mode-map [remap xref-find-references] #'lsp-ui-peek-find-references)
    (setq lsp-ui-sideline-enable nil
          lsp-ui-sideline-update-mode 'line
          lsp-ui-sideline-show-code-actions t
          lsp-ui-sideline-show-hover t
          lsp-ui-doc-enable nil
          lsp-ui-doc-include-signature t
          lsp-eldoc-enable-hover nil ; Disable eldoc displays in minibuffer
          lsp-ui-doc-position 'at-point
          lsp-ui-imenu-enable t
          lsp-ui-sideline-ignore-duplicate t)
    :commands lsp-ui-mode)

  (use-package helm-lsp :commands helm-lsp-workspace-symbol)
#+end_src
#+begin_src elisp :tangle no
  (use-package lsp-ui
    :config (setq lsp-ui-sideline-show-hover t
                  lsp-ui-sideline-delay 0.5
                  lsp-ui-sideline-show-diagnostics t
                  lsp-ui-sideline-show-code-actions t

                  lsp-enable-links nil
                  lsp-document-highlight-delay nil


                  lsp-ui-doc-delay 2.5
                  lsp-ui-doc-position 'bottom
                  lsp-ui-doc-alignment 'frame
                  lsp-ui-doc-header nil
                  lsp-ui-doc-include-signature t
                  lsp-ui-doc-use-childframe t)
    :hook ((prog-mode . lsp)
           (prog-mode . lsp-ui-mode)
           (prog-mode . lsp--cur-workspace-check)))
  (add-hook 'lsp-on-idle-hook #'lsp--document-highlight nil t)
#+end_src

** Flycheck
#+begin_src elisp
  (use-package flycheck :ensure t :config (setq flycheck-color-mode-line-face-to-color 'mode-line-buffer-id))
#+end_src

#+RESULTS:
: t

** Company for autocompletion
:PROPERTIES:
:ID:       07cbb73c-8027-4e69-b0f0-1fc175a867ad
:END:
#+begin_src elisp
  (use-package company
    :ensure t
    :hook
    (prog-mode . company-mode))
#+end_src

** Linum-mode
:PROPERTIES:
:ID:       c2e1f36c-9294-4f5a-a1a7-676c94d94d8e
:END:
#+begin_src elisp
  (use-package linum-mode
    :ensure nil
    :hook
    (prog-mode . linum-mode))
#+end_src

** hl-line mode
:PROPERTIES:
:ID:       de12079b-083c-484b-b8d7-6061cb40353c
:END:
#+begin_src elisp
  (add-hook 'prog-mode-hook 'hl-line-mode)
#+end_src

** Highlight-indent-guides mode
#+begin_src elisp
  (setq highlight-indent-guides-method 'column)
#+end_src

* DONE Org-mode

#+begin_src elisp
  (setq
   org-enforce-todo-dependencies t
   org-export-with-broken-links 'mark
   org-file-apps
   '((auto-mode . "setsid -w xdg-open %s")
     (default . "sleep 1")
     ("\\.mm\\'" . default)
     ("\\.x?html?\\'" . default)
     ("\\.pdf\\'" . "chromium %s")
     ("\\.docx\\'" . "lowriter %s")
     ("\\.odt\\'" . system))
   org-fontify-emphasized-text t
   org-fontify-quote-and-verse-blocks t
   org-format-latex-options
   '(:foreground default :background default :scale 1.5 :html-foreground "Black" :html-background "Transparent" :html-scale 1.0 :matchers
                 ("begin" "$1" "$" "$$" "\\[")))
  (set-face-attribute 'org-level-1 nil :extend nil :height 1.5 :weight 'bold)
  (set-face-attribute 'org-level-2 nil :extend nil :height 1.5 :weight 'bold)
  (set-face-attribute 'org-level-3 nil :extend nil :height 1.5 :weight 'bold)
  (set-face-attribute 'org-level-4 nil :extend nil :height 1.5 :weight 'bold)
  (set-face-attribute 'org-level-5 nil :extend nil :height 1.5 :weight 'bold)
  (set-face-attribute 'org-level-6 nil :extend nil :height 1.5 :weight 'bold)
  (set-face-attribute 'org-level-7 nil :extend nil :height 1.5 :weight 'bold)
  (set-face-attribute 'org-level-8 nil :extend nil :height 1.5 :weight 'bold)
  (set-face-attribute 'org-todo nil :foreground "#7f9f7f" :background "#222" :weight 'bold :box '(:line-width -6 :color "#222"))
  (set-face-attribute 'org-done nil :foreground "#7f9f7f" :background "#222" :weight 'bold :box '(:line-width -6 :color "#222"))
  (set-face-attribute 'org-headline-done nil :foreground nil)

  ;; (set-face-attribute 'org-level-1 nil :extend nil :weight 'bold :height 1.5 :foreground "LightCoral")
  ;; (set-face-attribute 'org-level-2 nil :extend nil :weight 'bold :height 1.5 :foreground "LightSalmon")
  ;; (set-face-attribute 'org-level-3 nil :extend nil :weight 'bold :height 1.5 :foreground "LightGoldenrod")
  ;; (set-face-attribute 'org-level-4 nil :extend nil :weight 'bold :height 1.5 :foreground "LightGreen")
  ;; (set-face-attribute 'org-level-5 nil :extend nil :weight 'bold :height 1.5 :foreground "LightSeaGreen")
  ;; (set-face-attribute 'org-level-6 nil :extend nil :weight 'bold :height 1.5 :foreground "LightSlateBlue")
  ;; (set-face-attribute 'org-level-7 nil :extend nil :weight 'bold :height 1.5 :foreground "LightCoral")
  ;; (set-face-attribute 'org-level-8 nil :extend nil :weight 'bold :height 1.5 :foreground "LightSalmon")
#+end_src

#+RESULTS:

** Olivetti Mode                                                      :test:
#+begin_src elisp
  (use-package olivetti
    :ensure t
    :defer t
    :bind ("C-x w" . olivetti-mode)
    :config
    (setq olivetti-body-width 122)
    (setq olivett-style 'fancy)
    (setq olivetti-margin-width 20)
    :hook (org-mode . olivetti-mode))


#+end_src

#+RESULTS:
: olivetti-mode
** Write-Room Mode                                           :disabled:test:
#+begin_src elisp :tangle no 
    (use-package writeroom-mode
      :ensure t
      :defer t
      :bind ("C-x w" . writeroom-mode)
                                            ;:hook (org-mode . writeroom-mode)
      :config
      (setq writeroom-width 120
            writeroom-mode-line t 
            writeroom-global-effects '(writeroom-set-alpha writeroom-set-menu-bar-lines writeroom-set-tool-bar-lines writeroom-set-vertical-scroll-bars writeroom-set-bottom-divider-width)
                                            ;writeroom-global-effects '(writeroom-set-bottom-divider-width
                                            ;writeroom-set-internal-border-width)
            )
  :hook (org-mode . writeroom-mode))

#+end_src

#+RESULTS:
: writeroom-mode

** TODO Org-mode
:PROPERTIES:
:ID:       feba8f0d-3670-4310-ae78-7f53a9e950c5
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2021-10-14 Thu 18:23]
:END:
#+begin_src emacs-lisp
  (use-package org
    :config
    (setq org-columns-default-format "%50ITEM %TODO %3PRIORITY %6Effort{:} %6CLOCKSUM(Clock) %TAGS ")
    :bind (("C-c w" . powerthesaurus-lookup-word-at-point)))
#+end_src

#+RESULTS:
: powerthesaurus-lookup-word-at-point

*** Org version 9.5 fontification fix--run as a hook for now
#+begin_src elisp
#+end_src

#+RESULTS:

** Org-Roam-ui                                                        :test:
#+begin_src elisp
  (use-package websocket :ensure t)
  (use-package simple-httpd :ensure t)
  (add-to-list 'load-path "~/.emacs.d/lisp/org-roam-ui")
  (load-library "org-roam-ui/org-roam-ui.el")
#+end_src

#+RESULTS:
: t

