settings.el

(use-package lsp-mode
  :ensure t
  :init
  (setq lsp-keymap-prefix "C-c l")
  :commands lsp lsp-deferred
  :hook ((lsp-after-open . lsp-enable-imenu)
         (lsp-after-open . lsp-toggle-symbol-highlight)
         (lsp-mode . lsp-enable-which-key-integration)
         (lsp-after-open . (lambda ()
                             (setq-local company-minimum-prefix-length 1
                                         company-idle-delay 0.0) ;; default is 0.2
                             )))
  :bind (:map lsp-mode-map
              ("C-c l t" . lsp-describe-thing-at-point)
              ("C-c l d" . lsp-ui-doc-show))
  :config
  (setq lsp-prefer-flymake nil)
  (setq lsp-auto-guess-root t ; Detect project root
        lsp-keep-workspace-alive nil ; Auto-kill LSP server
        lsp-prefer-capf t
        lsp-enable-indentation t
        lsp-enable-symbol-highlighting nil
        lsp-enable-on-type-formatting nil)
  :hook ((c-mode . lsp)
         (python-mode . lsp)))

;; lsp-ui: This contains all the higher level UI modules of lsp-mode, like flycheck support and code lenses.
;; https://github.com/emacs-lsp/lsp-ui
(use-package lsp-ui
  :ensure t
  :config
  (define-key lsp-ui-mode-map [remap xref-find-definitions] #'lsp-ui-peek-find-definitions)
  (define-key lsp-ui-mode-map [remap xref-find-references] #'lsp-ui-peek-find-references)
  (setq lsp-ui-sideline-enable nil
        lsp-ui-sideline-update-mode 'line
        lsp-ui-sideline-show-code-actions t
        lsp-ui-sideline-show-hover t
        lsp-ui-doc-enable t
        lsp-ui-doc-delay 1.0
        lsp-ui-doc-position 'bottom
        lsp-ui-doc-alignment 'frame
        lsp-ui-doc-include-signature t
        lsp-ui-doc-use-childframe t
        lsp-ui-doc-include-signature t
        lsp-eldoc-enable-hover nil ; Disable eldoc displays in minibuffer
        lsp-ui-doc-position 'at-point
        lsp-ui-imenu-enable t
        lsp-ui-sideline-ignore-duplicate t)
  :hook ((python-mode . lsp-ui-mode)
         (c-mode . lsp-ui-mode)))

;; debugger adapter protocol support for emacs
;; https://github.com/emacs-lsp/dap-mode/
(use-package dap-mode
  :ensure t
  :defer 4
  :config
  ;; call dap-hydra when going to the next breakpoint
  (add-hook 'dap-stopped-hook
            (lambda (arg) (call-interactively #'dap-hydra)))
  (add-hook 'dap-mode-hook #'dap-ui-mode) ; use a hook so users can remove it
  (dap-mode 1))

(use-package flycheck :ensure t :config (setq flycheck-color-mode-line-face-to-color 'mode-line-buffer-id))

(use-package company
  :ensure t
  :hook
  (prog-mode . company-mode))

(use-package linum-mode
  :ensure nil
  :hook
  (prog-mode . linum-mode))

(add-hook 'prog-mode-hook 'hl-line-mode)

(setq highlight-indent-guides-method 'column)

(setq
 org-enforce-todo-dependencies t
 org-export-with-broken-links 'mark
 org-file-apps
 '((auto-mode . "setsid -w xdg-open %s")
   (default . "sleep 1")
   ("\\.mm\\'" . default)
   ("\\.x?html?\\'" . default)
   ("\\.pdf\\'" . "chromium %s")
   ("\\.docx\\'" . "lowriter %s")
   ("\\.odt\\'" . system))
 org-fontify-emphasized-text t
 org-fontify-quote-and-verse-blocks t
 org-format-latex-options
 '(:foreground default :background default :scale 1.5 :html-foreground "Black" :html-background "Transparent" :html-scale 1.0 :matchers
               ("begin" "$1" "$" "$$" "\\[")))

(set-face-attribute 'org-level-1 nil :extend nil :weight 'bold :height 1.5 :foreground "LightCoral")
(set-face-attribute 'org-level-2 nil :extend nil :weight 'bold :height 1.5 :foreground "LightSalmon")
(set-face-attribute 'org-level-3 nil :extend nil :weight 'bold :height 1.5 :foreground "LightGoldenrod")
(set-face-attribute 'org-level-4 nil :extend nil :weight 'bold :height 1.5 :foreground "LightGreen")
(set-face-attribute 'org-level-5 nil :extend nil :weight 'bold :height 1.5 :foreground "LightSeaGreen")
(set-face-attribute 'org-level-6 nil :extend nil :weight 'bold :height 1.5 :foreground "LightSlateBlue")
(set-face-attribute 'org-level-7 nil :extend nil :weight 'bold :height 1.5 :foreground "LightCoral")
(set-face-attribute 'org-level-8 nil :extend nil :weight 'bold :height 1.5 :foreground "LightSalmon")

(use-package writeroom-mode
    :ensure t
    :defer t
    :bind ("C-x w" . writeroom-mode)
                                          ;:hook (org-mode . writeroom-mode)
    :config
    (setq writeroom-width 120
          writeroom-mode-line t 
          writeroom-global-effects '(writeroom-set-alpha writeroom-set-menu-bar-lines writeroom-set-tool-bar-lines writeroom-set-vertical-scroll-bars writeroom-set-bottom-divider-width)
                                          ;writeroom-global-effects '(writeroom-set-bottom-divider-width
                                          ;writeroom-set-internal-border-width)
          )
:hook (org-mode . writeroom-mode))



(use-package org-roam
      :ensure t
