settings.org
** ORG-ROAM                                                           :test:
#+begin_src elisp
  (use-package org-roam
    :ensure t
    :hook ((after-init . org-roam-setup)
           (org-roam-backlinks-mode . visual-line-mode))
    :config
    '(org-roam-dailies-capture-templates
      '(("d" "default" entry "* %?\
    " :target
    (file+head "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>
          ")
    :empty-lines-after 1
    :empty-lines-before 1)))

    (setq org-roam-capture-templates
          '(("d" "default" plain "%?" :target
             (file+head "pages/%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}
  ")
             :unnarrowed t)))
    (setq org-roam-v2-ack t)
    (org-roam-setup)
    (setq org-roam-directory "~/notes")
    (setq org-roam-dailies-directory "journals/")
    (setq org-roam-mode-section-functions
          (list #'org-roam-backlinks-section
                #'org-roam-reflinks-section
                ;; #'org-roam-unlinked-references-section
                ))
    :bind (("C-c n f" . org-roam-node-find)
           ("C-c n c" . org-roam-capture)
           ("C-c n g" . org-roam-ui-mode)
           ("C-c n r" . org-roam-node-random)		    
           ("C-c n d" . org-roam-dailies-capture-today)
           (:map org-mode-map
                 (("C-c n i" . org-roam-node-insert)
                  ("C-c C-w" . org-roam-refile)
                  ("C-c n o" . org-id-get-create)
                  ("C-c n t" . org-roam-tag-add)
                  ("C-c n a" . org-roam-alias-add)
                  ("C-c n l" . org-roam-buffer-toggle)))))
  (org-roam-db-autosync-mode)
#+end_src

#+RESULTS:
: t

** Org-roam-bibtex
#+begin_src elisp
(use-package org-roam-bibtex)
#+end_src

#+RESULTS:

** Org-auto-list
#+begin_src elisp
  (use-package org-autolist
    :ensure t
    :demand t
    :config
    (add-hook 'org-mode-hook 'org-autolist-mode))
#+end_src

#+RESULTS:
: t

** Org-drill
#+begin_src elisp
  (use-package org-drill
    :ensure t
    :config
    (setq 
     org-drill-cram-hours 0
     org-drill-hide-item-headings-p t
     org-drill-scope 'tree))
#+end_src

** Org-todo keywords and stuff
:PROPERTIES:
:ID:       c8bb328a-7b93-45e9-a44e-5b67e91ad3c7
:END:
#+begin_src elisp
  (setq org-todo-keywords
        '((sequence "TODO(t)" "NEXT(n)" "PROG(r)" "EXTD(e!)" "POST(p@!/@!)" "|" "CNCL(c@!/@!)" "DONE(d!)" "FAIL(f!)")))
#+end_src

#+RESULTS:
| sequence | TODO(t) | NEXT(n) | PROG(r) | EXTD(e!) | POST(p@!/@!) |   |   | CNCL(c@!/@!) | DONE(d!) | FAIL(f!) |

- TODO :: Not done yet
- NEXT :: Next up
- PROG :: Progress made--Started, but not finished
- EXTD :: Extended deadline. Already asked for extra time
- POST :: Postponed deadline.
- CNCL :: Cancelled--don't have to worry about it anymore
- DONE :: Successfully finished
- FAIL :: Task failed successfully.

#+RESULTS:
| sequence | TODO(t) | NEXT(n) | STARTED(s) | ET(e!) | POSTPONED(p@!/@!) | SOMEDAY |   |   | CANCELLED(c@!/@!) | DONE(d!) |

** Org-capture
:PROPERTIES:
:ID:       2698de88-4357-4b92-b7b7-e252794cae20
:END:
#+begin_src elisp
  (global-set-key (kbd "C-c c") 'org-capture)
  (setq org-capture-templates
        '(("p" "Personal TODO" entry
           (file+headline "~/Documents/personal.org" "Personal TODO list")
           "* TODO %^{Headline} :personal:%^{Tags}:
  SCHEDULED: %^{Scheduled}t DEADLINE: %^{Deadline}t
  :PROPERTIES:
  :EFFORT: %^{Effort}
  :END:
  ")
          ("H" "Habit" entry
           (file+headline "~/Documents/personal.org" "Personal TODO list")
           "* TODO %^{Headline} :personal:habit:%^{Tags}:
  SCHEDULED: %^{Scheduled}t
  :PROPERTIES:
  :EFFORT: %^{Effort}
  :STYLE: habit
  :END:
  ")
          ("n" "Quick note" entry
           (file+headline "~/Documents/personal.org" "Quick Notes")
           "* %^{Headline}
      ENTERED: %U
    " :prepend t)
          ("a" "Test/Assessment/Quiz " entry
           (file "~/org/todo.org")
           "* %^{Test Name} :school:%^{Tags}:
  DEADLINE: %^{Deadline}t ENTERED: %U" :prepend t :time-prompt t)
          ("P" "Project TODO" entry
           (file "~/org/todo.org")
           "* TODO %^{Project name} [/] :project:%^{Tags}:
  SCHEDULED: %^{Scheduled}t DEADLINE: %^{Deadline}t ENTERED: %U" :prepend t :time-prompt t)
          ("e" "Email TODO" entry
           (file "~/org/todo.org")
           "* TODO %^{Task} :email:%^{Tags}:
  DEADLINE: %^{Deadline}t ENTERED: %U" :prepend t :time-prompt t)
          ("m" "Meeting entry" entry
           (file "~/org/todo.org")
           "* %^{prompt} :meeting:%^{tags}:
      DEADLINE: %^{Deadline}T ENTERED: %U" :prepend t :time-prompt t)
          ("h" "Homework entry" entry
           (file "~/org/todo.org")
           "* TODO %^{prompt}    :school:homework:
  DEADLINE: %^{Deadline}t ENTERED %U
      :PROPERTIES:
      :EFFORT: %^{Effort}
      :END:
  " :prepend t :time-prompt t)))
#+end_src

#+RESULTS:
| p | Personal TODO | entry | (file+headline ~/Documents/personal.org Personal TODO list) | * TODO %^{Headline} :personal:%^{Tags}: |

** Flyspell
:PROPERTIES:
:ID:       9eed08c8-9578-43d9-a5a8-1ba8d534a047
:END:
#+begin_src elisp
  (add-hook 'org-mode-hook 'flyspell-mode)
#+end_src

** Thesaurus
:PROPERTIES:
:ID:       191ec399-20aa-474d-9887-899b0d29cc12
:END:
#+begin_src elisp
  (use-package powerthesaurus)
  ;; Keybinds for powerthesaurus are in the (use-package org) block (under the first org-mode settings header, org-mode)
#+end_src

#+RESULTS:

** Org-agenda
:PROPERTIES:
:ID:       2d0c099f-ae7f-44ba-a9ed-0f5d8ae915eb
:END:

