settings.el
      :hook ((after-init . org-roam-setup)
             (org-roam-backlinks-mode . visual-line-mode))
      :config
      '(org-roam-dailies-capture-templates
        '(("d" "default" entry "* %?\
" :target
    (file+head "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>
      ")
    :empty-lines-after 1
    :empty-lines-before 1)))
      (setq org-roam-v2-ack t)
      (org-roam-setup)
      (setq org-roam-directory "~/notes/")
      (setq org-roam-mode-section-functions
            (list #'org-roam-backlinks-section
                  #'org-roam-reflinks-section
                  ;; #'org-roam-unlinked-references-section
                  ))
      :bind (("C-c n f" . org-roam-node-find)
             ("C-c n c" . org-roam-capture)
             ("C-c n g" . org-roam-ui-mode)
             ("C-c n r" . org-roam-node-random)		    
             ("C-c n d" . org-roam-dailies-capture-today)
             (:map org-mode-map
                   (("C-c n i" . org-roam-node-insert)
                    ("C-c C-w" . org-roam-refile)
                    ("C-c n o" . org-id-get-create)
                    ("C-c n t" . org-roam-tag-add)
                    ("C-c n a" . org-roam-alias-add)
                    ("C-c n l" . org-roam-buffer-toggle)))))
    (org-roam-db-autosync-mode)

(use-package websocket :ensure t)
(use-package simple-httpd :ensure t)
(add-to-list 'load-path "~/.emacs.d/lisp/org-roam-ui")
;(load-library "org-roam-ui/")

(use-package org-autolist
  :ensure t
  :demand t
  :config
  (add-hook 'org-mode-hook 'org-autolist-mode))

(use-package org-drill
  :ensure t
  :config
  (setq 
   org-drill-cram-hours 0
   org-drill-hide-item-headings-p t
   org-drill-scope 'tree))

(setq org-todo-keywords
      '((sequence "TODO(t)" "NEXT(n)" "STARTED(s)" "ET(e!)" "POSTPONED(p@!/@!)" "SOMEDAY" "|" "CANCELLED(c@!/@!)" "DONE(d!)")))

(global-set-key (kbd "C-c c") 'org-capture)
(setq org-capture-templates
      '(("p" "Personal TODO" entry
         (file+headline "~/Documents/personal.org" "Personal TODO list")
         "* TODO %^{Headline} :personal:%^{Tags}:
SCHEDULED: %^{Scheduled}t DEADLINE: %^{Deadline}t
:PROPERTIES:
:EFFORT: %^{Effort}
:END:
")
        ("H" "Habit" entry
         (file+headline "~/Documents/personal.org" "Personal TODO list")
         "* TODO %^{Headline} :personal:habit:%^{Tags}:
SCHEDULED: %^{Scheduled}t
:PROPERTIES:
:EFFORT: %^{Effort}
:STYLE: habit
:END:
")
        ("n" "Quick note" entry
         (file+headline "~/Documents/personal.org" "Quick Notes")
         "* %^{Headline}
    ENTERED: %U
  " :prepend t)
        ("a" "Test/Assessment/Quiz " entry
         (file "~/org/todo.org")
         "* %^{Test Name} :school:%^{Tags}:
DEADLINE: %^{Deadline}t ENTERED: %U" :prepend t :time-prompt t)
        ("P" "Project TODO" entry
         (file "~/org/todo.org")
         "* TODO %^{Project name} [/] :project:%^{Tags}:
SCHEDULED: %^{Scheduled}t DEADLINE: %^{Deadline}t ENTERED: %U" :prepend t :time-prompt t)
        ("e" "Email TODO" entry
         (file "~/org/todo.org")
         "* TODO %^{Task} :email:%^{Tags}:
DEADLINE: %^{Deadline}t ENTERED: %U" :prepend t :time-prompt t)
        ("m" "Meeting entry" entry
         (file "~/org/todo.org")
         "* %^{prompt} :meeting:%^{tags}:
    DEADLINE: %^{Deadline}T ENTERED: %U" :prepend t :time-prompt t)
        ("h" "Homework entry" entry
         (file "~/org/todo.org")
         "* TODO %^{prompt}    :school:homework:
DEADLINE: %^{Deadline}t ENTERED %U
    :PROPERTIES:
    :EFFORT: %^{Effort}
    :END:
" :prepend t :time-prompt t)))

(add-hook 'org-mode-hook 'flyspell-mode)

(use-package powerthesaurus)
;; Keybinds for powerthesaurus are in the (use-package org) block (under the first org-mode settings header, org-mode)
