settings.org
*** Org-agenda
:PROPERTIES:
:ID:       9d26e9b9-ce6e-4fc8-8666-01306ca89dd1
:END:
The agenda files are maintained by customize-variable, and are not defined or managed here.
#+begin_src elisp
  (use-package org-agenda
    :ensure nil
    :bind ("C-c a" . org-agenda)
    :config
    (setq org-agenda-columns-add-appointments-to-effort-sum t
          org-agenda-skip-deadline-if-done nil
          org-agenda-skip-scheduled-if-deadline-is-shown 'not-today;'repeated-after-deadline
          org-agenda-skip-timestamp-if-deadline-is-shown nil
          org-agenda-entry-text-maxlines 20
          org-agenda-include-diary t

          org-agenda-prefix-format " %?-3t %-11s %3e "
          org-agenda-prefix-format " %?-3t %-11s %3e "
          org-agenda-keyword-format '("")
          org-agenda-remove-tags t

          ;; '((agenda . "%i%?5t%s%4e  ")
          ;;   (todo . "  %?-i%?4e  ")
          ;;   (tags . "  %?-i%?4e  "))

          org-agenda-sorting-strategy '((agenda deadline-down todo-state-up priority-down category-keep)
                                        (todo priority-down category-keep)
                                        (tags priority-down category-keep)
                                        (search category-keep))
          org-agenda-skip-scheduled-if-done t
          org-agenda-span 'day))
  (setq org-agenda-custom-commands
        '(("g" "Good agenda"
           ((agenda ""
                    ((org-agenda-overriding-header "Agenda and Tonight's Homework")
                     (org-agenda-sorting-strategy '(time-up deadline-up todo-state-down priority-down effort-down scheduled-down))
                     (org-super-agenda-groups
                      `(
                        (:name "Meetings" :tag "meeting" :tag "clubs" :tag "club" :order 2)
                        (:name "OVERDUE" :discard
                               (:todo "SOMEDAY")
                               :deadline past :order 1)
                        (:name "School Habits" :and (:tag "school" :tag "habit") :order 4)
                        (:name "Homework"
                               :and (:tag "school" :tag "homework" :deadline (before ,(org-read-date nil nil "+8d")))
                               :order 5 )
                        (:name "Today's Schedule" :time-grid t :order 2)
                        (:name "Tests and Quizzes" :tag
                               ("test" "quiz" "assessment" "conference")
                               :order 3)
                        (:name "Upcoming Schoolwork/Homework" 
                               :and (:tag ("school" "homework") :deadline future)
                               :order 6)
                        (:name "Personal Habits"
                               :and (:tag "personal" :habit t)
                               :order 8)
                        (:name "Personal TODO list"
                               :tag ("personal")
                               :order 7)
                        (:name "Emails" :tag "email" :order 8)
                        (:name "Scheduled work"
                               :scheduled t 
                               :order 10)
                        (:time-grid t)
                        (:discard (:tag "drill"))))))
            (alltodo ""
                     ((org-agenda-overriding-header "PROJECTS")
          (org-agenda-prefix-format " %?-3t %?-11s %3e ")
                      (org-super-agenda-groups
                       '((:discard (:todo "SOMEDAY" :not (:tag "PROJECT")))
                         (:auto-outline-path t)
                         (:discard
                          (:anything))))))
            (alltodo ""
                     ((org-agenda-overriding-header "Other")
          (org-agenda-prefix-format " %?-3t %3e ")
                      (org-super-agenda-groups
                       '((:name "Bucket List" :and
                                (:todo "SOMEDAY" :tag "PERSONAL")
                                :order 1)
                         (:name "Someday Maybe" :todo "SOMEDAY" :order 10)
                         (:name "Everything Else" :anything t :order 20))))))
           nil nil)
          ("n" "Agenda and all TODOs"
           ((agenda "" nil)
            (alltodo "" nil))
           nil)))
#+end_src

#+RESULTS:
| g | Good agenda          | ((agenda  ((org-agenda-overriding-header Agenda and Tonight's Homework) (org-agenda-sorting-strategy '(time-up deadline-up todo-state-down priority-down effort-down scheduled-down)) (org-super-agenda-groups `((:name Meetings :tag meeting :tag clubs :tag club :order 2) (:name OVERDUE :discard (:todo SOMEDAY) :deadline past :order 1) (:name School Habits :and (:tag school :tag habit) :order 4) (:name Homework :and (:tag school :tag homework :deadline (before ,(org-read-date nil nil +8d))) :order 5) (:name Today's Schedule :time-grid t :order 2) (:name Tests and Quizzes :tag (test quiz assessment conference) :order 3) (:name Upcoming Schoolwork/Homework :and (:tag (school homework) :deadline future) :order 6) (:name Personal Habits :and (:tag personal :habit t) :order 8) (:name Personal TODO list :tag (personal) :order 7) (:name Emails :tag email :order 8) (:name Scheduled work :scheduled t :order 10) (:time-grid t) (:discard (:tag drill)))))) (alltodo  ((org-agenda-overriding-header PROJECTS) (org-agenda-prefix-format  %?-3t %?-11s %3e ) (org-super-agenda-groups '((:discard (:todo SOMEDAY :not (:tag PROJECT))) (:auto-outline-path t) (:discard (:anything)))))) (alltodo  ((org-agenda-overriding-header Other) (org-agenda-prefix-format  %?-3t %3e ) (org-super-agenda-groups '((:name Bucket List :and (:todo SOMEDAY :tag PERSONAL) :order 1) (:name Someday Maybe :todo SOMEDAY :order 10) (:name Everything Else :anything t :order 20)))))) | nil | nil |
| n | Agenda and all TODOs | ((agenda  nil) (alltodo  nil))                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                             | nil |     |

*** Org-mobile
:PROPERTIES:
:ID:       81bf30cd-8137-4f6a-aa76-7f79eaa72e63
:END:
#+begin_src elisp
  (setq org-mobile-directory "~/Dropbox/Apps/MobileOrg")
#+end_src

*** Org-super-agenda
:PROPERTIES:
:ID:       bc78f029-dfd6-48d3-a8c0-2ff8eaf10674
:END:
#+begin_src emacs-lisp
  (use-package org-super-agenda
    :ensure t
    :config
    (setq org-super-agenda-header-map (make-sparse-keymap))
    (setq org-super-agenda-groups
          '((:time-grid t)
            (:name "OVERDUE" :discard
                   (:todo "SOMEDAY")
                   :deadline past :order 1)
            (:name "Today's Schedule" :time-grid t :order 2)
            (:name "Meetings" :tag "meeting" :order 2)
            (:name "Tests and Quizzes" :tag
                   ("test" "quiz" "assessment" "conference")
                   :order 3)
            (:name "Ongoing Futuredue Homework" 
                   :and
                   (:tag "school" :tag "homework" :deadline future :scheduled today :not (:tag "project"))
                   :and
                   (:tag "school" :tag "homework" :deadline future :scheduled past :not (:tag "project"))
                   :order 4)
            (:name "Tonight's Homework"
                   :and
                   (:tag "school" :tag "homework" :deadline today)
                   :and
                   (:tag "school" :tag "project" :deadline today)
                   :and
                   (:tag "school" :tag "homework" :scheduled (today past) :not (:tag "project"))
                   :order 5)
            (:name "Upcoming Homework" 
                   :and (:not (:tag "project") :tag "school" :tag "homework" :deadline future)
                   :order 6)
            (:name "Emails" :tag "email" :order 7)
            (:discard (:tag "drill"))))
    :hook
    (org-agenda-before-finalize . org-super-agenda-mode))
#+end_src

#+RESULTS:
| org-super-agenda-mode |

** Org-ql                                                             :test:
#+begin_src elisp
  (use-package org-ql
:ensure t)
#+end_src

#+RESULTS:

** Org-noter stuff
:PROPERTIES:
:ID:       cabacb17-121f-436c-a539-2cca134e03cc
:END:

*** Pdf-tools
:PROPERTIES:
:ID:       101b700e-cb09-42ec-a8d3-c7978370c2f2
:END:
#+begin_src emacs-lisp
  (use-package pdf-tools
    :ensure t
    :pin manual
    :config
    ;;initialize
    ;; use normal isearch
    (define-key pdf-view-mode-map (kbd "h") 'pdf-annot-add-highlight-markup-annotation)
    (define-key pdf-view-mode-map (kbd "d") 'pdf-annot-delete)
    (define-key pdf-view-mode-map (kbd "s") 'save-buffer)
    (define-key pdf-view-mode-map (kbd "C-s") 'isearch-forward))
    (pdf-tools-install)
#+end_src

#+RESULTS:
: t

*** Org-noter
:PROPERTIES:
:ID:       0b7394c6-cba5-4258-a064-e3648ecade1e
:END:
#+begin_src emacs-lisp
  (use-package org-noter-pdftools :ensure t)
  (use-package org-noter
    :ensure t
    :config
    (require 'org-noter-pdftools))
#+end_src

#+RESULTS:
: t

*** A bunch of requires that IDK why they make it work
:PROPERTIES:
:ID:       33196297-4c02-4b29-b0a7-cb9677a64f98
:END:
#+begin_src elisp
  (require 'org-noter-pdftools)
  (require 'org-pdftools)
  (require 'pdf-history)
  (require 'pdf-links)
  (require 'pdf-sync)
  (require 'pdf-outline)
#+end_src

** Org-indent-mode
:PROPERTIES:
:ID:       11ebf78e-cd30-4fcb-ba47-bf90d6c96cf2
:END:
#+begin_src elisp
  (add-hook 'org-mode-hook 'org-indent-mode)
#+end_src

