settings.el

(use-package org-agenda
  :ensure nil
  :bind ("C-c a" . org-agenda)
  :config
  (setq org-agenda-columns-add-appointments-to-effort-sum t
        org-agenda-skip-deadline-if-done nil
        org-agenda-skip-scheduled-if-deadline-is-shown t
        org-agenda-skip-timestamp-if-deadline-is-shown t
        org-agenda-entry-text-maxlines 20
        org-agenda-include-diary t
        org-agenda-prefix-format
        '((agenda . " %i%?5t%s%4e  ")
          (todo . " %i%?4e  ")
          (tags . " %i%?4e  "))
        org-agenda-sorting-strategy '((agenda deadline-down todo-state-up priority-down category-keep)
                                      (todo priority-down category-keep)
                                      (tags priority-down category-keep)
                                      (search category-keep))
        org-agenda-skip-scheduled-if-deadline-is-shown t
        org-agenda-skip-scheduled-if-done t
        org-agenda-span 'day))
(setq org-agenda-custom-commands
      '(("g" "Good agenda"
         ((agenda ""
                  ((org-agenda-overriding-header "Agenda and Tonight's Homework")
                   (org-agenda-sorting-strategy '(time-up deadline-up todo-state-down priority-down effort-down scheduled-down))
                   (org-super-agenda-groups
                    `((:time-grid t)
                      (:name "Meetings" :tag "meeting" :tag "clubs" :tag "club" :order 2)
                      (:name "OVERDUE" :discard
                             (:todo "SOMEDAY")
                             :deadline past :order 1)
                      (:name "School Habits" :and (:tag "school" :tag "habit") :order 4)
                      (:name "Today's Schedule" :time-grid t :order 2)
                      (:name "Tests and Quizzes" :tag
                             ("test" "quiz" "assessment" "conference")
                             :order 3)
                      (:name "Homework"
                             :and (:tag "school" :tag "homework" :deadline (before ,(org-read-date nil nil "+8d")))
                             :order 5 )
                      (:name "Upcoming Schoolwork/Homework" 
                             :and (:tag ("school" "homework") :deadline future)
                             :order 6)
                      (:name "Personal Habits"
                             :and (:tag "personal" :habit t)
                             :order 8)
                      (:name "Personal TODO list"
                             :tag ("personal")
                             :order 7)
                      (:name "Emails" :tag "email" :order 8)
                      (:name "Scheduled work"
                             :scheduled t 
                             :order 10)
                      (:discard (:tag "drill"))))))
          (alltodo ""
                   ((org-agenda-overriding-header "PROJECTS")
                    (org-super-agenda-groups
                     '((:discard (:todo "SOMEDAY" :not (:tag "PROJECT")))
                       (:auto-outline-path t)
                       (:discard
                        (:anything))))))
          (alltodo ""
                   ((org-agenda-overriding-header "Other")
                    (org-super-agenda-groups
                     '((:name "Bucket List" :and
                              (:todo "SOMEDAY" :tag "PERSONAL")
                              :order 1)
                       (:name "Someday Maybe" :todo "SOMEDAY" :order 10)
                       (:name "Everything Else" :anything t :order 20))))))
         nil nil)
        ("n" "Agenda and all TODOs"
         ((agenda "" nil)
          (alltodo "" nil))
         nil)))

(setq org-mobile-directory "~/Dropbox/Apps/MobileOrg")

(use-package org-ql
:ensure t)

(require 'org-noter-pdftools)
(require 'org-pdftools)
(require 'pdf-history)
(require 'pdf-links)
(require 'pdf-sync)
(require 'pdf-outline)

(add-hook 'org-mode-hook 'org-indent-mode)
