settings.org
** Org-variable-pitch
:PROPERTIES:
:ID:       caae4a05-17aa-4265-98e4-a5340b9a1f20
:END:
#+begin_src elisp

  (use-package org-variable-pitch
    :config
    (setq org-variable-pitch-fixed-faces '(org-block
                                           org-block-begin-line
                                           org-block-end-line
                                           org-code
                                           org-document-info-keyword
                                           org-done
                                           org-formula
                                           org-indent
                                           org-meta-line
                                           org-special-keyword
                                           org-table
                                          org-todo
                                           org-verbatim
                                           org-date
                                           org-drawer
                                          ;org-link
                                          ;link
                                           centaur-tabs-default
                                           org-property-value
                                           org-priority
                                           ;; org-level-1
                                           ;; org-level-2
                                           ;; org-level-3
                                           ;; org-level-4
                                           ;; org-level-5
                                           ;; org-level-6
                                           ;; org-level-7
                                           ;; org-level-8
                                           org-hide
                                           org-superstar-leading
                                           ;; org-superstar-bullet
                                           org-target))
    :hook ((org-mode) . org-variable-pitch-minor-mode))
#+end_src

#+RESULTS:
| org-superstar-mode | org-variable-pitch-minor-mode | org-indent-mode | #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | flyspell-mode | org-autolist-mode | org-ref-org-menu | olivetti-mode | evil-org-mode | visual-line-mode | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | org-ref-setup-label-finders |

** Notifications and reminders
:PROPERTIES:
:ID:       06a9d01f-8b3f-4ee4-902d-cd340f6d1c8e
:END:
#+begin_src elisp
  (require 'calendar)
  (setq appt-display-interval 3
        appt-message-warning-time 15
        org-show-notification-handler "notify-send")

  (require 'notifications)

  (defcustom appt-notification-bus :session
    "D-bus bus to use for notification."
    :group 'appt-notification
    :type '(choice (const :tag "Session bus" :session) string))
  (defun appt-display (min-to-appt new-time msg)
    "Send notification."
    (notifications-notify :bus appt-notification-bus
                          :title (format "Appointment in %s minutes" min-to-appt)
                          :body (format "%s" msg)
                          :replaces-id nil
                          :app-icon nil
                          :timeout 5000
                          :desktop-entry "emacs"))
  (setq appt-disp-window-function 'appt-display)
  (add-hook 'org-agenda-finalize-hook 'org-agenda-to-appt)
  (appt-activate)
#+end_src

#+RESULTS:
: Appointment reminders enabled

** Ox-pandoc
:PROPERTIES:
:ID:       e88ba805-fd6d-4ebe-b9cb-5e9a7b406487
:END:
#+begin_src elisp
  (use-package ox-pandoc)
#+end_src

** Org-notebook
:PROPERTIES:
:ID:       12b58aff-1c85-467f-990e-3646fa3a8a0c
:END:
#+begin_src elisp :results quiet
  (use-package org-notebook
    :config
    (setq org-notebook-drawing-program "kolourpaint"))
#+end_src

#+RESULTS:
: t

** Org-superstar-mode
:PROPERTIES:
:ID:       bcbf7dc5-5ba2-4543-a380-b6928f4bda82
:END:
:BACKLINKS:
[2021-03-15 Mon 10:00] <- [[*Super links][Super links]]
:END:
#+begin_src elisp
  (use-package org-superstar
    :hook
    (org-mode . org-superstar-mode))
#+end_src

** Super links                                                     :disabled:
:PROPERTIES:
:ID:       c60f1f32-e63e-4be9-a386-e784124a5d2f
:END:
#+begin_src elisp :tangle no
  (use-package org-super-links
    :bind (("C-c s l" . sl-link))
    :config
    (setq org-id-link-to-org-use-id 'create-if-interactive-and-no-custom-id))
#+end_src

** Org-download
:PROPERTIES:
:ID:       c53fe1c3-fa53-4266-b8c3-82cb32978475
:END:
Provides image download functionality and stuff.
#+begin_src elisp
  (use-package org-download)
#+end_src

#+RESULTS:

** Org-ref
:PROPERTIES:
:ID:       402f2292-d0d8-4a56-9608-d9bd69798465
:END:
#+begin_src elisp
      (use-package org-ref
  :bind ("C-c r i" . org-ref-insert-link))
#+end_src

#+RESULTS:
: org-ref-insert-link

** Helm-bibtex
#+begin_src elisp
(use-package helm-bibtex)
#+end_src

#+RESULTS:

** Calfw
:PROPERTIES:
:ID:       f857e22e-4113-4b27-a539-0a2217ac7b67
:END:
#+begin_src elisp
  (use-package calfw)
  (use-package calfw-org)
#+end_src

** Org-roam-bibtex                                                    :test:
#+begin_src elisp :tangle no
    (use-package org-roam-bibtex
  :after org-roam
:config (require 'org-ref))
#+end_src

#+RESULTS:

* TODO Centaur Tabs                                                :disabled:
:PROPERTIES:
:ID:       bfe02ca7-adf3-46fd-8db2-f5a7c0e119a4
:END:
#+begin_src elisp :tangle no
  (use-package centaur-tabs
    :ensure t
    :demand t
    :config
    (setq centaur-tabs-style "wave"
          centaur-tabs-set-bar nil
          centaur-tabs-set-icons t
          centaur-tabs-gray-out-icons 'buffer
          centaur-tabs-height 26
          centaur-tabs-set-modified-marker t
          centaur-tabs-modifier-marker "*")
    (centaur-tabs-headline-match)
    (centaur-tabs-mode t)
    :bind
    ("C-<prior>" . centaur-tabs-backward)
    ("C-<next>" . centaur-tabs-forward))
#+end_src

#+RESULTS:
: centaur-tabs-forward

* Diminish
#+begin_src elisp
  (use-package diminish
    :demand t
    :init
    (diminish 'evil-org-mode)
    (diminish 'buffer-face-mode)
    (diminish 'org-indent-mode)
    (diminish 'helm-mode)
    (diminish 'org-autolist-mode)
    (diminish 'undo-tree-mode)
    (diminish 'visual-line-mode "VL")
    (diminish 'flyspell-mode "SPL")
    (diminish 'org-roam-ui-mode "RUI")
    (diminish 'org-roam-ui-follow-mode)
    (diminish 'undo-tree-mode))
#+end_src

#+RESULTS:

